{"pages":[{"tags":"about-me","text":"你好，我是袁克倫，你可以叫我 dokelung，我是一名小小軟體工程師，專長是電子設計自動化。 愛學習也愛分享，寫書來推廣熱愛的知識一直是我的夢想。 本應與 C++ 共度一生，卻意外成為 Python 的終極狂熱者，幾乎生活上的大小事都想用 Python 解決(可惜吃飯和上廁所不行)，酷愛有關於 Python 的一切。 My books My papers My presentations My projects Experiences R & D Engineer, ATopTech , 2015-now. Administrator of substitute services draftees, BAPHIQ, 2014. Biology teacher, New Taipei Municipal Touqian Junior High School, 2013. Network/system management, EDA union lab of EDA group, NTU, 2012-2013. link Network management, BOT dorm, NTU, 2011-2013. Teaching assistant, computer-aided VLSI system design, GIEE NTU, 2012-2013. Python Tutor, 2012. Web maintainer, ALCOM lab, 2011-2012. Research Interesting Electronics Design Automation Logic synthesis Hardware/software formal verification and VLSI testing Multi-valued encoding Multiset constraint solving Timing analysis Clock tree synthesis Honors The 2nd place, CAD Contest at ICCAD, 2014. ( 國際積體電路電腦輔助設計競賽 ) M.S. Best Thesis Award, GIEE, NTU, 2013. ( 台大電子所最佳碩論 ) M.S. Thesis Award, Chuan Yan Technology, Taiwan, 2013. ( 全研科技論文獎 ) Award for Excellent Performance, Trend Micro Programming Contest, 2012. The Second Award, ICCAD Contest, Ministry of Education, Taiwan, 2011. Award of outstanding student for academic achievement, Dept. of EE, NCKU, 2007-2008. ( 成大書卷獎 ) Education M.S., EDA group- ALCom lab , Graduate Institute of Electronics Engineering, National Taiwan University, 2011-2013. B.S., Electrical Engineering, National Cheng Kung University, 2007-2011.","title":"About Me","url":"pages/about-me/"},{"tags":"books","text":"My Books Cover Name Intro Author Is's Django - 用Python迅速打造Web應用 A book about python web framework Django 袁克倫(dokelung) 楊孟穎 Python 快速入門 適合初學者的 Python 快速入門 袁克倫(dokelung)","title":"Books","url":"pages/books/"},{"tags":"papers","text":"Conference Papers Title Conferece Author ncoding Multi-Valued Functions for Symmetry ICCAD-2013 K.-L. Yuan(dokelung) C.-Y. Kuo J.-H. Jiang M.-Y. Li Automatic Test Pattern Generation for Delay Defects Using Timed Characteristic Functions ICCAD-2013 S.-Y. Ho S.-R. Lin K.-L. Yuan(dokelung) C.-Y. Kuo K.-Y. Liao J.-H. Jiang C.-M. Li","title":"Papers","url":"pages/papers/"},{"tags":"presentations","text":"My Presentations Title Activity Link Python與電子設計自動化:用愛與堅持實現專業 Pycon APAC 2015 Talk / Slides / Video 自己的書自己寫--沒人寫就自幹的Django書寫之旅 Taipei.py","title":"Presentations","url":"pages/presentations/"},{"tags":"projects","text":"Project list Name Intro Python-QA 透過問答，了解世界。Python 的世界 jojo A friendly Pelican theme tinp Library of input functions with type conversion minickt Analyzer and simulator of logic circuit msat Multiset Constraint Solver for Multi-SAT","title":"Projects","url":"pages/projects/"},{"tags":"pelican","text":"測試頁! 可愛的 jojo","title":"測試頁","url":"category/pelican/test/"}]}